#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.apidoc will be created
  + resource "aws_s3_bucket" "apidoc" {
      + acceleration_status                  = (known after apply)
      + acl                                  = (known after apply)
      + arn                                  = (known after apply)
      + bucket                               = "apidoc-dev.constellationnetwork.io"
      + bucket_domain_name                   = (known after apply)
      + bucket_regional_domain_name          = (known after apply)
      + cors_rule                            = (known after apply)
      + force_destroy                        = false
      + grant                                = (known after apply)
      + hosted_zone_id                       = (known after apply)
      + id                                   = (known after apply)
      + lifecycle_rule                       = (known after apply)
      + logging                              = (known after apply)
      + object_lock_enabled                  = (known after apply)
      + policy                               = (known after apply)
      + region                               = (known after apply)
      + replication_configuration            = (known after apply)
      + request_payer                        = (known after apply)
      + server_side_encryption_configuration = (known after apply)
      + tags_all                             = (known after apply)
      + versioning                           = (known after apply)
      + website                              = (known after apply)
      + website_domain                       = (known after apply)
      + website_endpoint                     = (known after apply)

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)
          + rule                = (known after apply)
        }
    }

  # aws_s3_bucket_acl.apidoc_acl will be created
  + resource "aws_s3_bucket_acl" "apidoc_acl" {
      + acl    = "public-read"
      + bucket = "apidoc-dev.constellationnetwork.io"
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # aws_s3_bucket_policy.apidoc_policy will be created
  + resource "aws_s3_bucket_policy" "apidoc_policy" {
      + bucket = "apidoc-dev.constellationnetwork.io"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = [
                          + "arn:aws:s3:::apidoc-dev.constellationnetwork.io/*",
                        ]
                      + Sid       = "PublicReadGetObject"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_s3_bucket_website_configuration.apidoc_website will be created
  + resource "aws_s3_bucket_website_configuration" "apidoc_website" {
      + bucket           = "apidoc-dev.constellationnetwork.io"
      + id               = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "error.html"
        }

      + index_document {
          + suffix = "index.html"
        }
    }

  # module.openapi_block_explorer.null_resource.openapi will be created
  + resource "null_resource" "openapi" {
      + id       = (known after apply)
      + triggers = {
          + "openapi_spec_sha1" = "b3e3fab0e86372a8891454cf5b742baea546b822"
          + "s3_bucket_path"    = "apidoc-dev.constellationnetwork.io"
          + "s3_prefix"         = "block-explorer"
        }
    }

  # module.openapi_block_explorer.null_resource.openapi_static will be created
  + resource "null_resource" "openapi_static" {
      + id       = (known after apply)
      + triggers = {
          + "s3_bucket_path" = "apidoc-dev.constellationnetwork.io"
        }
    }

  # module.openapi_node_owner.null_resource.openapi will be created
  + resource "null_resource" "openapi" {
      + id       = (known after apply)
      + triggers = {
          + "openapi_spec_sha1" = "b08bf738867fec637a7a37193768b7ceee0870aa"
          + "s3_bucket_path"    = "apidoc-dev.constellationnetwork.io"
          + "s3_prefix"         = "node-owner"
        }
    }

  # module.openapi_node_owner.null_resource.openapi_static will be created
  + resource "null_resource" "openapi_static" {
      + id       = (known after apply)
      + triggers = {
          + "s3_bucket_path" = "apidoc-dev.constellationnetwork.io"
        }
    }

  # module.openapi_node_public.null_resource.openapi will be created
  + resource "null_resource" "openapi" {
      + id       = (known after apply)
      + triggers = {
          + "openapi_spec_sha1" = "cabcc7befb6c9abf2035183d94f9f770b0268578"
          + "s3_bucket_path"    = "apidoc-dev.constellationnetwork.io"
          + "s3_prefix"         = "node-public"
        }
    }

  # module.openapi_node_public.null_resource.openapi_static will be created
  + resource "null_resource" "openapi_static" {
      + id       = (known after apply)
      + triggers = {
          + "s3_bucket_path" = "apidoc-dev.constellationnetwork.io"
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @marcinwadon, Action: `pull_request`*